cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'neovim/neovim'

# Dependencies
brew 'autoconf'
brew 'automake'
brew 'coreutils'
brew 'libtool'
brew 'libxslt'
brew 'libyaml'
brew 'openssl'
brew 'readline'
brew 'unixodbc'

# Brews
brew 'git'
brew 'gnupg'
brew 'neovim'
brew 'pinentry-mac'
brew 'python3' # This is only needed for some nvim plugins
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'tmux'

# Essential Casks
cask 'alfred'
cask 'google-chrome'
cask 'iterm2'
